# Use the brackets to select a single pandas DataFrame column and not dot notation

### Reasons

1. Select column names with spaces
1. Select column names that have the same name as methods
1. Select columns with variables
1. Select non-string columns
1. Set new columns
1. Select multiple columns
1. Dot notation is a strict subset of the brackets
1. Use one way which works for all situations
1. Auto-completion works in the brackets and following it
1. Brackets are the canonical way to select subsets for all objects

In [1]:
import pandas as pd
df = pd.DataFrame({'name': ['Niko', 'Penelope', 'Aria'],
                   'average score': [10, 5, 3],
                   'max': [99, 100, 3]})
df

       name  average score  max
0      Niko             10   99
1  Penelope              5  100
2      Aria              3    3

## 1. Select column names with spaces

In [2]:
df.name

0        Niko
1    Penelope
2        Aria
Name: name, dtype: object

In [3]:
df.average score

SyntaxError: invalid syntax (<ipython-input-3-53744aa263dd>, line 1)

In [4]:
df['average score']

0    10
1     5
2     3
Name: average score, dtype: int64

## 2. Select column names that have the same name as methods

In [5]:
df

       name  average score  max
0      Niko             10   99
1  Penelope              5  100
2      Aria              3    3

In [9]:
df.max

<bound method DataFrame.max of        name  average score  max
0      Niko             10   99
1  Penelope              5  100
2      Aria              3    3>

In [8]:
df['max']

0     99
1    100
2      3
Name: max, dtype: int64

## 3. Select columns with variables

In [10]:
col = 'name'

In [11]:
df.col

AttributeError: 'DataFrame' object has no attribute 'col'

In [12]:
df[col]

0        Niko
1    Penelope
2        Aria
Name: name, dtype: object

## 4. Select non-string columns

In [13]:
df[0] = 5

In [14]:
df

       name  average score  max  0
0      Niko             10   99  5
1  Penelope              5  100  5
2      Aria              3    3  5

In [15]:
df.0

SyntaxError: invalid syntax (<ipython-input-15-74b769b7016d>, line 1)

In [16]:
df[0]

0    5
1    5
2    5
Name: 0, dtype: int64

## 5. Set new columns

In [17]:
df.new_col = 5

In [18]:
df

       name  average score  max  0
0      Niko             10   99  5
1  Penelope              5  100  5
2      Aria              3    3  5

In [21]:
df['new_col'] = 99

In [22]:
df

       name  average score  max  0  new_col
0      Niko             10   99  5       99
1  Penelope              5  100  5       99
2      Aria              3    3  5       99

## 6. Select multiple columns

In [23]:
df[['name', 'max']]

       name  max
0      Niko   99
1  Penelope  100
2      Aria    3

## 7. Dot notation is a strict subset of the brackets

## 8. Use one way which works for all situations

## 9. Auto-completion works in the brackets and following it

In [24]:
df

       name  average score  max  0  new_col
0      Niko             10   99  5       99
1  Penelope              5  100  5       99
2      Aria              3    3  5       99

In [ ]:
df.name.

In [ ]:
df['average score'].

## 10. Brackets are the canonical way to select subsets for all objects

In [25]:
a = [1, 2, 3, 4 ,5]

In [27]:
a[3]

4

In [28]:
a[:3]

[1, 2, 3]

In [29]:
d = {'a': 1}

In [30]:
d['a']

1

In [31]:
s = 'asdfadsfasdfsdafs'

In [32]:
s[5:10]

'dsfas'